# 14. 그룹화
동일한 값을 가진 것들끼리 합쳐서 통계 또는 평균 등의 값을 계산하기 위해 사용

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')

In [2]:
df.groupby('학교')

In [3]:
df.groupby('학교').get_group('북산고')

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85      Python
2번    정대만  북산고  184  40  35   50  55  25        Java
3번    송태섭  북산고  168  80  75   70  80  75  Javascript
4번    서태웅  북산고  187  40  60   70  75  80         NaN
5번    강백호  북산고  188  15  20   10  35  10         NaN

In [6]:
df.groupby('학교').get_group('능남고')

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6번    변덕규  능남고  202   80  100  95  85  80       C
7번    황태산  능남고  188   55   65  45  40  35  PYTHON
8번    윤대협  능남고  190  100   85  90  95  95      C#

In [17]:
df.groupby('학교')[['키', '국어', '영어', '수학', '과학', '사회']].mean()

              키         국어         영어         수학         과학    사회
학교
능남고  193.333333  78.333333  83.333333  76.666667  73.333333  70.0
북산고  184.800000  53.000000  55.000000  60.000000  68.000000  55.0

In [19]:
df.groupby('학교').size() # 각 그룹의 크기

학교
능남고    3
북산고    5
dtype: int64

In [23]:
df.groupby('학교').size()['능남고']

3

In [25]:
df.groupby('학교')['키'].mean()

학교
능남고    193.333333
북산고    184.800000
Name: 키, dtype: float64

In [26]:
# 학년 컬럼 추가
df['학년'] = [3, 3, 2, 1, 1, 3, 2, 2]

In [27]:
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python   3
2번    정대만  북산고  184   40   35   50  55  25        Java   3
3번    송태섭  북산고  168   80   75   70  80  75  Javascript   2
4번    서태웅  북산고  187   40   60   70  75  80         NaN   1
5번    강백호  북산고  188   15   20   10  35  10         NaN   1
6번    변덕규  능남고  202   80  100   95  85  80           C   3
7번    황태산  능남고  188   55   65   45  40  35      PYTHON   2
8번    윤대협  능남고  190  100   85   90  95  95          C#   2

In [31]:
df.groupby(['학교', '학년'])[['국어','영어','수학']].mean()

          국어     영어    수학
학교  학년
능남고 2   77.5   75.0  67.5
    3   80.0  100.0  95.0
북산고 1   27.5   40.0  40.0
    2   80.0   75.0  70.0
    3   65.0   60.0  75.0

In [34]:
df.groupby('학년')[['과학', '키']].mean()

           과학           키
학년
1   55.000000  187.500000
2   71.666667  182.000000
3   78.333333  194.333333

In [35]:
df.groupby('학년')[['과학', '키']].mean().sort_values('키')

           과학           키
학년
2   71.666667  182.000000
1   55.000000  187.500000
3   78.333333  194.333333

In [36]:
df.groupby(['학교', '학년']).sum()

            이름    키   국어   영어   수학   과학   사회        SW특기
학교  학년
능남고 2   황태산윤대협  378  155  150  135  135  130    PYTHONC#
    3      변덕규  202   80  100   95   85   80           C
북산고 1   서태웅강백호  375   55   80   80  110   90           0
    2      송태섭  168   80   75   70   80   75  Javascript
    3   채치수정대만  381  130  120  150  150  110  PythonJava

In [38]:
# 학교로 그룹화를 한 뒤에 각 학교별 SW특기 데이터의 수를 가져옴
df.groupby('학교')[['이름', 'SW특기']].count()

     이름  SW특기
학교
능남고   3     3
북산고   5     3

In [39]:
school = df.groupby('학교')
school['학년'].value_counts()
# 학교로 그룹화를 한 뒤에 학년별 학생 수를 가져옴

학교   학년
능남고  2     2
     3     1
북산고  1     2
     3     2
     2     1
Name: count, dtype: int64

In [41]:
school['학년'].value_counts().loc['능남고']
# 학교로 그룹화를 한 뒤에 능남고에 대해서 학년별 학생 수를 가져옴

학년
2    2
3    1
Name: count, dtype: int64

In [43]:
# 학생들의 수 데이터를 퍼센트로 비교하여 가져옴
school['학년'].value_counts(normalize=True).loc['북산고']

학년
1    0.4
3    0.4
2    0.2
Name: proportion, dtype: float64